RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_hid.c
/***************************************************************************//**
* \file cy_usb_dev_hid.c
* \version 2.10
*
* Provides HID class-specific API implementation.
*
********************************************************************************
* \copyright
* (c) 2018-2021, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include "cy_usb_dev_hid.h"

#if (defined(CY_IP_MXUSBFS) || defined(CY_IP_M0S8USBDSS))


/*******************************************************************************
*                             Internal Macro
*******************************************************************************/

/* Get Idle request response length */
#define HID_IDLE_RATE_LENGTH        (1U)

/* Get Protocol request response length */
#define HID_PROTOCOL_LENGTH         (1U)

/* Set protocol mask */
#define HID_PROTOCOL_MASK           (0x01U)

/* Set default idle rate */
#define HID_IDLE_RATE_INDEFINITE    (0U)


/*******************************************************************************
* Internal Functions Prototypes
*******************************************************************************/

static void HandleBusReset(void *classContext, cy_stc_usb_dev_context_t *devContext);

static cy_en_usb_dev_status_t HandleRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                            void *classContext,
                                            cy_stc_usb_dev_context_t *devContext);

static cy_en_usb_dev_status_t HandleRequestComplete(cy_stc_usb_dev_control_transfer_t *transfer,
                                                    void *classContext,
                                                    cy_stc_usb_dev_context_t *devContext);

static cy_en_usb_dev_status_t GetDescriptorHidReportRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                                            cy_stc_usb_dev_hid_t const *hid);

static cy_en_usb_dev_status_t GetDescriptorHidClassRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                                           cy_stc_usb_dev_hid_t const *hid);

static cy_en_usb_dev_status_t GetReportRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                               cy_stc_usb_dev_hid_context_t const *context);

static cy_en_usb_dev_status_t GetProtocolRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                                   cy_stc_usb_dev_hid_context_t *context);

static cy_en_usb_dev_status_t GetIdleRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                             cy_stc_usb_dev_hid_t const *hid,
                                             cy_stc_usb_dev_hid_context_t *context);

static cy_en_usb_dev_status_t SetReportRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                               cy_stc_usb_dev_hid_context_t const *context);

static cy_en_usb_dev_status_t SetReportRequestComplete(cy_stc_usb_dev_control_transfer_t *transfer,
                                                       cy_stc_usb_dev_hid_context_t const *context);

static cy_en_usb_dev_status_t SetProtocolRequest(cy_stc_usb_dev_control_transfer_t const *transfer,
                                                 cy_stc_usb_dev_hid_context_t *context);

static void UpdateIdleRateTimer(uint32_t idx, cy_stc_usb_dev_hid_context_t *context);

static cy_en_usb_dev_status_t SetIdleRequest(cy_stc_usb_dev_control_transfer_t const *transfer,
                                             cy_stc_usb_dev_hid_t const *hid,
                                             cy_stc_usb_dev_hid_context_t *context);

static cy_stc_usb_dev_hid_t const * GetHidStruct(uint32_t intf,
                                                cy_stc_usb_dev_context_t *devContext);

static cy_en_usb_dev_status_t GetInputReportIdx(uint32_t reportId, uint32_t *idx,
                                                cy_stc_usb_dev_hid_t const *hid,
                                                cy_stc_usb_dev_hid_context_t const *context);


/*******************************************************************************
* Function Name: Cy_USB_Dev_HID_Init
****************************************************************************//**
*
* Initializes the HID class.
* This function must be called to enable USB Device HID functionality.
*
* \param config
* The pointer to the HID configuration
* structure \ref cy_stc_usb_dev_hid_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \param devContext
* The pointer to the USB Device context structure \ref cy_stc_usb_dev_context_t.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_HID_Init(cy_stc_usb_dev_hid_config_t const *config,
                                           cy_stc_usb_dev_hid_context_t      *context,
                                           cy_stc_usb_dev_context_t          *devContext)
{
    /* Input parameters verification */
    if ((NULL == config) || (NULL == context) || (NULL == devContext))
    {
        return CY_USB_DEV_BAD_PARAM;
    }

    /* SETUP data storage */
    context->idleRate  = config->timers;
    context->idleTimer = &config->timers[config->timersNum];
    context->timersNum = config->timersNum;

    /* Remove custom handlers */
    context->handleGetReport = NULL;
    context->handleSetReport = NULL;

    /* Store device context */
    context->devContext = devContext;

