RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_hid.c
    /* Register HID handlers */
    Cy_USB_Dev_RegisterClassBusResetCallback(&HandleBusReset, Cy_USB_Dev_HID_GetClass(context));
    Cy_USB_Dev_RegisterClassRequestRcvdCallback(&HandleRequest, Cy_USB_Dev_HID_GetClass(context));
    Cy_USB_Dev_RegisterClassRequestCmpltCallback(&HandleRequestComplete, Cy_USB_Dev_HID_GetClass(context));

    return Cy_USB_Dev_RegisterClass(&context->classItem, &context->classObj, context, devContext);
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_HID_UpdateTimer
****************************************************************************//**
*
* Updates the HID Report idle timer and returns the status of the timer. This
* function also reloads the timer if it expires.
*
* \param interface
* Contains the interface number that contains the HID descriptor whose HID timer
* needs to be updated.
*
* \param reportId
* Report ID whose HID timer needs to be updated.
* Pass 0 if report ID is not used.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* The state of the HID timer \ref cy_en_usb_dev_hid_timer_state_t
*
*******************************************************************************/
cy_en_usb_dev_hid_timer_state_t Cy_USB_Dev_HID_UpdateTimer(uint32_t  interface,
                                                           uint32_t  reportId,
                                        cy_stc_usb_dev_hid_context_t *context)
{
    cy_en_usb_dev_hid_timer_state_t retState = CY_USB_DEV_HID_TIMER_INDEFINITE;

    cy_stc_usb_dev_hid_t const *hidStruct = GetHidStruct(interface, context->devContext);

    /* Check that HID exists for given interface */
    CY_ASSERT_L1(NULL != hidStruct);

    if (NULL != hidStruct)
    {
        uint32_t idx;
        cy_en_usb_dev_status_t locStatus = GetInputReportIdx(reportId, &idx, hidStruct, context);

        /* Check that Report ID exists for given interface */
        CY_ASSERT_L1(CY_USB_DEV_SUCCESS == locStatus);

        if (CY_USB_DEV_SUCCESS == locStatus)
        {
            /* Protect from race condition between SET_IDLE request and timer update */
            uint32_t intrState = Cy_SysLib_EnterCriticalSection();

            /* Check if duration is defined */
            if (context->idleRate[idx] != HID_IDLE_RATE_INDEFINITE)
            {
                /* Run timer */
                if (context->idleTimer[idx] > 0U)
                {
                    context->idleTimer[idx]--;
                    retState = CY_USB_DEV_HID_TIMER_RUNNING;
                }
                else
                {
                    context->idleTimer[idx] = context->idleRate[idx];
                    retState = CY_USB_DEV_HID_TIMER_EXPIRED;
                }
            }

            Cy_SysLib_ExitCriticalSection(intrState);
        }
    }

    return retState;
}


/*******************************************************************************
* Function Name: HandleBusReset
****************************************************************************//**
*
* Handles Bus Reset event: clears HID protocol and idle rate timers.
*
* \param classContext
* Contains the interface number that contains the HID descriptor whose HID timer
* needs to be updated.
*
* \param devContext
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
*
*******************************************************************************/
static void HandleBusReset(void *classContext, cy_stc_usb_dev_context_t *devContext)
{
    /* Suppress a compiler warning about unused variables */
    (void) devContext;

    cy_stc_usb_dev_hid_context_t *context = (cy_stc_usb_dev_hid_context_t *) classContext;

    /* Set protocol to default */
    (void) memset((void *) context->protocol, (int32_t) CY_USB_DEV_HID_PROTOCOL_REPORT, (uint32_t) CY_USB_DEV_NUM_INTERFACES_MAX);

    /* Set idle rate to default */
    (void) memset(context->idleRate,  (int32_t) HID_IDLE_RATE_INDEFINITE, (uint32_t) context->timersNum);
    (void) memset(context->idleTimer, (int32_t) HID_IDLE_RATE_INDEFINITE, (uint32_t) context->timersNum);
}


/*******************************************************************************
* Function Name: HandleRequest
****************************************************************************//**
*
* Handles HID class requests (SETUP packet received event).
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param classContext
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \param devContext
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for
* internal configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                     void *classContext,
                                     cy_stc_usb_dev_context_t *devContext)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Get HID pointer for this interface (all HID requests using wIndex to pass interface) */
    cy_stc_usb_dev_hid_t const *hidStruct = GetHidStruct((uint32_t) transfer->setup.wIndex, devContext);

    if (NULL == hidStruct)
    {
        return CY_USB_DEV_REQUEST_NOT_HANDLED;
    }

