RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_hid.c
    /* Process standard requests */
    if (CY_USB_DEV_STANDARD_TYPE == transfer->setup.bmRequestType.type)
    {
        if (CY_USB_DEV_RQST_GET_DESCRIPTOR == transfer->setup.bRequest)
        {
            switch (CY_USB_DEV_GET_DESCR_TYPE(transfer->setup.wValue))
            {
                case CY_USB_DEV_HID_REPORT_DESCRIPTOR:
                    retStatus = GetDescriptorHidReportRequest(transfer, hidStruct);
                break;

                case CY_USB_DEV_HID_DESCRIPTOR:
                    retStatus = GetDescriptorHidClassRequest(transfer, hidStruct);
                break;

                default:
                    /* The request was not recognized */
                break;
            }
        }
    }
    /* Process class-specific requests */
    else if (CY_USB_DEV_CLASS_TYPE == transfer->setup.bmRequestType.type)
    {
        /* Get HID context */
        cy_stc_usb_dev_hid_context_t *context = (cy_stc_usb_dev_hid_context_t *) classContext;

        if (transfer->direction == CY_USB_DEV_DIR_DEVICE_TO_HOST)
        {
            switch (transfer->setup.bRequest)
            {
                case CY_USB_DEV_HID_RQST_GET_REPORT:
                    retStatus = GetReportRequest(transfer, context);
                break;

                case CY_USB_DEV_HID_RQST_GET_PROTOCOL:
                    retStatus = GetProtocolRequest(transfer, context);
                break;

                case CY_USB_DEV_HID_RQST_GET_IDLE:
                    retStatus = GetIdleRequest(transfer, hidStruct, context);
                break;

                default:
                    /* The request was not recognized */
                break;
            }
        }
        else
        {
            switch (transfer->setup.bRequest)
            {
                case CY_USB_DEV_HID_RQST_SET_REPORT:
                    retStatus = SetReportRequest(transfer, context);
                break;

                case CY_USB_DEV_HID_RQST_SET_PROTOCOL:
                    retStatus = SetProtocolRequest(transfer, context);
                break;

                case CY_USB_DEV_HID_RQST_SET_IDLE:
                    retStatus = SetIdleRequest(transfer, hidStruct, context);
                break;

                default:
                    /* The request was not recognized */
                break;
            }
        }
    }
    else
    {
        /* The request was not recognized */
    }

    return (retStatus);
}


/*******************************************************************************
* Function Name: HandleRequestComplete
****************************************************************************//**
*
* Completes handling HID class requests that expects data from the host.
* Involved when data from the host was received.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param classContext
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \param devContext
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for
* internal configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleRequestComplete(cy_stc_usb_dev_control_transfer_t *transfer,
                                                    void *classContext,
                                                    cy_stc_usb_dev_context_t *devContext)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Suppress a compiler warning about unused variables */
    (void) devContext;

    if (CY_USB_DEV_HID_RQST_SET_REPORT == transfer->setup.bRequest)
    {
        retStatus = SetReportRequestComplete(transfer, (cy_stc_usb_dev_hid_context_t *) classContext);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: GetDescriptorHidReportRequest
****************************************************************************//**
*
* Handles GET_DESCRIPOR HID Report request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param hid
* The pointer to the the structure that holds HID Class information.
*
* \return
* Returns \ref CY_USB_DEV_SUCCESS.
* The HandleRequest function checks that HID structure exist for the
* specified interface before calling GetDescriptorHidReportRequest function.
* Therefore GetDescriptorHidReportRequest successfully access to
* the HID structure.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetDescriptorHidReportRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                                            cy_stc_usb_dev_hid_t const *hid)
{
    /* SETUP control transfer */
    transfer->ptr       = (uint8_t *) hid->reportDescriptor;
    transfer->remaining = hid->reportDescriptorSize;

    return CY_USB_DEV_SUCCESS;
}


/*******************************************************************************
* Function Name: GetDescriptorHidClassRequest
****************************************************************************//**
*
* Handles GET_DESCRIPOR HID Class request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param hid
* The pointer to the the structure that holds HID Class information.
*
* \return
* Returns \ref CY_USB_DEV_SUCCESS.
* The HandleRequest function checks that HID structure exist for the
* specified interface before calling GetDescriptorHidClassRequest function.
* Therefore GetDescriptorHidClassRequest successfully access to
* the HID structure.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetDescriptorHidClassRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                                           cy_stc_usb_dev_hid_t const *hid)
{
    /* SETUP control transfer */
    transfer->ptr       = (uint8_t *) hid->hidDescriptor;
    transfer->remaining = CY_USB_DEV_HID_DESCRIPTOR_LENGTH;

    return CY_USB_DEV_SUCCESS;
}


