RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_hid.c
/*******************************************************************************
* Function Name: GetReportRequest
****************************************************************************//**
*
* Handles GET_REPORT HID Class request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetReportRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                               cy_stc_usb_dev_hid_context_t const *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    if (NULL != context->handleGetReport)
    {
        uint32_t rptSize;

        /* Get from the user report to send */
        retStatus = context->handleGetReport(
                                (uint32_t) transfer->setup.wIndex,         /* Interface */
                                (uint32_t) CY_HI8(transfer->setup.wValue), /* Report Type */
                                (uint32_t) CY_LO8(transfer->setup.wValue), /* Report ID */
                                &(transfer->ptr),
                                &rptSize);

        transfer->remaining = (uint16_t) rptSize;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: GetProtocolRequest
****************************************************************************//**
*
* Handles GET_PROTOCOL HID Class request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetProtocolRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                                 cy_stc_usb_dev_hid_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    uint32_t interface = transfer->setup.wIndex;

    if (interface < CY_USB_DEV_NUM_INTERFACES_MAX)
    {
        /* SETUP control transfer */
        transfer->ptr       = (uint8_t *) &context->protocol[interface];
        transfer->remaining = HID_PROTOCOL_LENGTH;

        retStatus = CY_USB_DEV_SUCCESS;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: GetIdleRequest
****************************************************************************//**
*
* Handles GET_IDLE HID Class request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param hid
* The pointer to the the structure that holds HID Class information.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetIdleRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                             cy_stc_usb_dev_hid_t const        *hid,
                                             cy_stc_usb_dev_hid_context_t      *context)
{
    cy_en_usb_dev_status_t retStatus;
    uint32_t idx;

    retStatus = GetInputReportIdx((uint32_t) transfer->setup.wValue, &idx, hid, context);

    if (CY_USB_DEV_SUCCESS == retStatus)
    {
        /* SETUP control transfer */
        transfer->ptr       = &context->idleRate[idx];
        transfer->remaining = HID_IDLE_RATE_LENGTH;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: SetReportRequest
****************************************************************************//**
*
* Handles SET_REPORT HID Class request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t SetReportRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                               cy_stc_usb_dev_hid_context_t const *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    if (NULL != context->handleSetReport)
    {
        /* SETUP control transfer */
        transfer->remaining = transfer->setup.wLength;
        transfer->notify    = true;

        retStatus = CY_USB_DEV_SUCCESS;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: SetReportRequestComplete
****************************************************************************//**
*
* Completes handling SET_REPORT HID Class request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t SetReportRequestComplete(cy_stc_usb_dev_control_transfer_t *transfer,
                                                       cy_stc_usb_dev_hid_context_t const *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    if (NULL != context->handleSetReport)
    {
        /* Provide the user with report data */
        retStatus = context->handleSetReport(
                                (uint32_t) transfer->setup.wIndex,         /* Interface */
                                (uint32_t) CY_HI8(transfer->setup.wValue), /* Report Type */
                                (uint32_t) CY_LO8(transfer->setup.wValue), /* Report ID */
                                transfer->ptr,
                                (uint32_t) transfer->size);
    }

