RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_hid.c
    return retStatus;
}


/*******************************************************************************
* Function Name: SetProtocolRequest
****************************************************************************//**
*
* Handles SET_PROTOCOL HID Class request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t SetProtocolRequest(cy_stc_usb_dev_control_transfer_t const *transfer,
                                                 cy_stc_usb_dev_hid_context_t      *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    uint32_t interface = transfer->setup.wIndex;

    if (interface < CY_USB_DEV_NUM_INTERFACES_MAX)
    {
        context->protocol[interface] = (uint8_t) (transfer->setup.wValue & HID_PROTOCOL_MASK);

        /* SETUP control transfer, no data stage */
        retStatus = CY_USB_DEV_SUCCESS;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: UpdateIdleRateTimer
****************************************************************************//**
*
* Updates Idle Rate timer after SET_IDLE request was received.
*
* \param idx
* Idle Rate timer index.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
*******************************************************************************/
static void UpdateIdleRateTimer(uint32_t idx, cy_stc_usb_dev_hid_context_t *context)
{
    /* Reset timer if Idle rate indefinite */
    if (HID_IDLE_RATE_INDEFINITE == context->idleRate[idx])
    {
        context->idleTimer[idx] = 0U;
    }
    else
    {
        /* HID spec: Set_Idle request Latency */
        if (context->idleTimer[idx] >= context->idleRate[idx])
        {
            /* Reload the timer: wait new period */
            context->idleTimer[idx] = context->idleRate[idx];
        }
        else
        {
            if (context->idleTimer[idx] >= 1U)
            {
                /* If the current period has gone past the newly prescribed
                * time duration, then a report will be generated immediately.
                * Clear timer to return TIMER_EXPIRED on next HID_UpdateTimer call.
                */
                context->idleTimer[idx] = 0U;
            }
            else
            {
                /* A new request will be executed as if it were issued
                * immediately after the last report, if the new request
                * is received at least 4 milliseconds before the end of
                * the currently executing period. If the new request is
                * received within 4 milliseconds of the end of the
                * current period, then the new request will have no
                * effect until after the report
                */

                /* Do nothing: let HID_UpdateTimer continue to counting
                * and return TIMER_EXPIRED status.
                */
            }
        }
    }
}


/*******************************************************************************
* Function Name: SetIdleRequest
****************************************************************************//**
*
* Handles SET_IDLE HID Class request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param hid
* The pointer to the the structure that holds HID Class information.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t SetIdleRequest(cy_stc_usb_dev_control_transfer_t const *transfer,
                                             cy_stc_usb_dev_hid_t const        *hid,
                                             cy_stc_usb_dev_hid_context_t      *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    uint32_t reportId = CY_LO8(transfer->setup.wValue);
    uint32_t idx;

    /* Get report ID index */
    retStatus = GetInputReportIdx(reportId, &idx, hid, context);

    if (CY_USB_DEV_SUCCESS == retStatus)
    {
        if (reportId > 0U)
        {
            /* Set IdleRate for defined report ID then update idle timers */
            context->idleRate[idx] = CY_HI8(transfer->setup.wValue);
            UpdateIdleRateTimer(idx, context);
        }
        else
        {
            /* Set IdleRate to all Report IDs for this HID interface */
            (void) memset(&context->idleRate[idx], (int32_t) CY_HI8(transfer->setup.wValue), (uint32_t) hid->numInputReports);

            /* Update idle timers */
            for(;idx < hid->numInputReports; ++idx)
            {
                UpdateIdleRateTimer(idx, context);
            }
        }
    }

    /* SETUP control transfer, no data stage */

    return retStatus;
}


/*******************************************************************************
* Function Name: GetHidStruct
****************************************************************************//**
*
* Returns the pointer to the structure that holds HID Class information
* for a certain interface.
*
* \param intf
* Interface number.
*
* \param devContext
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t allocated
* by the user.
*
* \return
* The pointer to HID interface structure \ref cy_stc_usb_dev_hid_t.
* If interface protocol is not HID the NULL pointer is returned.
*
*******************************************************************************/
static cy_stc_usb_dev_hid_t const * GetHidStruct(uint32_t intf, cy_stc_usb_dev_context_t *devContext)
{
    uint32_t cfg = Cy_USB_Dev_GetConfigurationIdx(devContext);

    cy_stc_usb_dev_hid_t const *hidStruct = NULL;

    /* Check if interface is valid */
    if (intf < devContext->devDescriptors->configurations[cfg]->numInterfaces)
    {
        uint32_t alt = Cy_USB_Dev_GetAlternateSettings(intf, devContext);

        /* Get report descriptor */
        hidStruct = devContext->devDescriptors->configurations[cfg]->interfaces[intf]->alternates[alt]->hid;
    }

