RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_hid.c
    return hidStruct;
}


/*******************************************************************************
* Function Name: GetInputReportIdx
****************************************************************************//**
*
* Finds idle rate timer index for a certain report ID.
*
* \param reportId
* Report ID. If there is no report ID, zero must be passed.
*
* \param idx
* Idle rate timer index.
*
* \param hid
* The pointer to the the structure that holds HID Class information.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_hid_context_t
* allocated by the user. The structure is used during the HID Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetInputReportIdx(uint32_t reportId, uint32_t *idx,
                                                cy_stc_usb_dev_hid_t const   *hid,
                                                cy_stc_usb_dev_hid_context_t const *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    if (0U == reportId)
    {
        /* Return start index in idleTimer array */
        *idx = hid->inputReportPos;
        retStatus = CY_USB_DEV_SUCCESS;
    }
    else
    {
        /* Check that input report ID exists */
        if (reportId < hid->inputReportIdxSize)
        {
            /* Get report ID index in timers array */
            uint32_t tmpIdx = (uint32_t) hid->inputReportIdx[reportId];

            /* Check that index value is valid (0 is free location) */
            if ((tmpIdx > 0U) && (tmpIdx <= context->timersNum))
            {
                /* Return index in idleTimer array for report ID */
                *idx = (tmpIdx - 1U);
                retStatus = CY_USB_DEV_SUCCESS;
            }
        }
    }

    return retStatus;
}

#endif /* (defined(CY_IP_MXUSBFS) || defined(CY_IP_M0S8USBDSS)) */


/* [] END OF FILE */
